; domain
(define (domain satellite)
  (:requirements :strips :equality :typing)
  (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:action turn-to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
           )
  )

 
  (:action switch-on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch-off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )


  (:action take-image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
               )
   :effect (have_image ?d ?m)
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	thermograph4 - mode
	image1 - mode
	thermograph3 - mode
	image2 - mode
	thermograph0 - mode
	GroundStation3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation0 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Planet15 - direction
	Planet16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Star19 - direction
	Star20 - direction
	Planet21 - direction
	Star22 - direction
	Planet23 - direction
	Star24 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image2)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation0)
	(supports instrument2 image1)
	(supports instrument2 thermograph3)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument3 thermograph0)
	(supports instrument3 thermograph4)
	(supports instrument3 image2)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation1)
	(supports instrument4 thermograph4)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 GroundStation1)
	(supports instrument5 thermograph4)
	(calibration_target instrument5 GroundStation4)
	(supports instrument6 thermograph3)
	(supports instrument6 image1)
	(calibration_target instrument6 GroundStation0)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation2)
	(supports instrument7 image2)
	(supports instrument7 thermograph3)
	(calibration_target instrument7 GroundStation4)
	(supports instrument8 thermograph4)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation2)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation4)
	(supports instrument9 thermograph0)
	(supports instrument9 image2)
	(supports instrument9 image1)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 thermograph3)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet15)
	(supports instrument11 thermograph0)
	(supports instrument11 image2)
	(calibration_target instrument11 GroundStation1)
	(on_board instrument11 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Phenomenon11)
)
(:goal (and
	(pointing satellite0 Planet21)
	(pointing satellite2 Star14)
	(pointing satellite5 Planet17)
	(have_image Phenomenon5 image1)
	(have_image Phenomenon7 thermograph0)
	(have_image Planet8 image2)
	(have_image Star9 thermograph0)
	(have_image Star10 thermograph3)
	(have_image Phenomenon12 thermograph0)
	(have_image Phenomenon13 image1)
	(have_image Star14 thermograph4)
	(have_image Planet15 image2)
	(have_image Planet17 image2)
	(have_image Phenomenon18 image1)
	(have_image Star19 thermograph4)
	(have_image Star20 thermograph4)
	(have_image Planet21 thermograph0)
	(have_image Star22 thermograph3)
	(have_image Planet23 image1)
))

(:metric minimize (total-time))
)

; plan
1. (turn-to satellite2 groundstation1 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 groundstation1)
   goals met: 0 of 19
2. (switch-on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 0 of 19
3. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 19
4. (turn-to satellite2 planet23 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 planet23)
   goals met: 0 of 19
5. (take-image satellite2 planet23 instrument4 image1)
   added: (have_image planet23 image1)
   goals met: 1 of 19
6. (turn-to satellite2 planet21 planet23)
   deleted: (pointing satellite2 planet23)
   added: (pointing satellite2 planet21)
   goals met: 1 of 19
7. (take-image satellite2 planet21 instrument4 thermograph0)
   added: (have_image planet21 thermograph0)
   goals met: 2 of 19
8. (turn-to satellite2 phenomenon13 planet21)
   deleted: (pointing satellite2 planet21)
   added: (pointing satellite2 phenomenon13)
   goals met: 2 of 19
9. (take-image satellite2 phenomenon13 instrument4 image1)
   added: (have_image phenomenon13 image1)
   goals met: 3 of 19
10. (turn-to satellite2 phenomenon18 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon18)
   goals met: 3 of 19
11. (take-image satellite2 phenomenon18 instrument4 image1)
   added: (have_image phenomenon18 image1)
   goals met: 4 of 19
12. (turn-to satellite2 phenomenon5 phenomenon18)
   deleted: (pointing satellite2 phenomenon18)
   added: (pointing satellite2 phenomenon5)
   goals met: 4 of 19
13. (take-image satellite2 phenomenon5 instrument4 image1)
   added: (have_image phenomenon5 image1)
   goals met: 5 of 19
14. (turn-to satellite2 star14 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 star14)
   goals met: 6 of 19
15. (take-image satellite2 star14 instrument4 thermograph4)
   added: (have_image star14 thermograph4)
   goals met: 7 of 19
16. (turn-to satellite2 star19 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star19)
   goals met: 6 of 19
17. (take-image satellite2 star19 instrument4 thermograph4)
   added: (have_image star19 thermograph4)
   goals met: 7 of 19
18. (turn-to satellite2 star9 star19)
   deleted: (pointing satellite2 star19)
   added: (pointing satellite2 star9)
   goals met: 7 of 19
19. (take-image satellite2 star9 instrument4 thermograph0)
   added: (have_image star9 thermograph0)
   goals met: 8 of 19
20. (turn-to satellite2 phenomenon12 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 phenomenon12)
   goals met: 8 of 19
21. (take-image satellite2 phenomenon12 instrument4 thermograph0)
   added: (have_image phenomenon12 thermograph0)
   goals met: 9 of 19
22. (turn-to satellite5 planet17 phenomenon11)
   deleted: (pointing satellite5 phenomenon11)
   added: (pointing satellite5 planet17)
   goals met: 10 of 19
23. (switch-on instrument7 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument7)
   goals met: 10 of 19
24. (calibrate satellite3 instrument7 groundstation4)
   added: (calibrated instrument7)
   goals met: 10 of 19
25. (turn-to satellite3 star22 groundstation4)
   deleted: (pointing satellite3 groundstation4)
   added: (pointing satellite3 star22)
   goals met: 10 of 19
26. (take-image satellite3 star22 instrument7 thermograph3)
   added: (have_image star22 thermograph3)
   goals met: 11 of 19
27. (turn-to satellite3 planet8 star22)
   deleted: (pointing satellite3 star22)
   added: (pointing satellite3 planet8)
   goals met: 11 of 19
28. (take-image satellite3 planet8 instrument7 image2)
   added: (have_image planet8 image2)
   goals met: 12 of 19
29. (turn-to satellite0 planet21 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 planet21)
   goals met: 13 of 19
30. (turn-to satellite3 planet15 planet8)
   deleted: (pointing satellite3 planet8)
   added: (pointing satellite3 planet15)
   goals met: 13 of 19
31. (take-image satellite3 planet15 instrument7 image2)
   added: (have_image planet15 image2)
   goals met: 14 of 19
32. (turn-to satellite3 star10 planet15)
   deleted: (pointing satellite3 planet15)
   added: (pointing satellite3 star10)
   goals met: 14 of 19
33. (take-image satellite3 star10 instrument7 thermograph3)
   added: (have_image star10 thermograph3)
   goals met: 15 of 19
34. (turn-to satellite2 star20 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star20)
   goals met: 15 of 19
35. (take-image satellite2 star20 instrument4 thermograph4)
   added: (have_image star20 thermograph4)
   goals met: 16 of 19
36. (turn-to satellite3 planet17 star10)
   deleted: (pointing satellite3 star10)
   added: (pointing satellite3 planet17)
   goals met: 16 of 19
37. (take-image satellite3 planet17 instrument7 image2)
   added: (have_image planet17 image2)
   goals met: 17 of 19
38. (turn-to satellite2 phenomenon7 star20)
   deleted: (pointing satellite2 star20)
   added: (pointing satellite2 phenomenon7)
   goals met: 17 of 19
39. (take-image satellite2 phenomenon7 instrument4 thermograph0)
   added: (have_image phenomenon7 thermograph0)
   goals met: 18 of 19
40. (turn-to satellite2 star14 phenomenon7)
   deleted: (pointing satellite2 phenomenon7)
   added: (pointing satellite2 star14)
   goals met: 19 of 19
